# 문제 : 골드 러시
# 강산이와 지현이는 모험 중에 어느 숲 속 깊숙히에서 신비한 동굴을 발견했다.
#
# 들떠서 동굴에 입장한 강산이와 지현이는 결국 동굴의 끝에서 거대한 금괴 하나를 발견했다.
#
# 하지만 둘이서 들고 나가기엔 금괴는 너무 거대하고 무거웠다.
#
# 방법이 없을까 고민하던 중, 지현이가 금괴에 숫자 n이 쓰여 있는 것을 발견했다.
#
# 그 순간 요정이 나타나 말했다.
#
# 요정 : 이 금괴는 무거워. 이건 무려 2n 펨토그램인걸. 게다가 n은 62까지 갈 수 있다구.
# 강산 : 어, 그렇다면 운이 좋은걸요! 지현이 가방은 정확히 a 펨토그램을 담을 수 있고, 제 가방은 b 펨토그램을 담을 수 있는데 이때 a + b = 2n을 만족하니까요!
# 지현 : 근데 어떻게 금괴를 자르지?
# 요정 : 내 마법으로 어떤 물건이든 정확히 반토막을 낼 수 있어. 근데 난 마법을 하루에 한 번밖에 못 쓰는데..
# 강산이와 지현이는 며칠 후, 금괴를 모두 나눠 갖고 동굴을 나섰다.
#
# 이때, 강산이와 지현이가 동굴을 나선 건 동굴에 들어온 뒤 며칠 뒤일까?
# 입력
# 입력의 첫 줄엔 테스트 케이스의 수 t ≤ 1000 가 주어진다.
# 그리고 t줄에 걸쳐, 정수 n, a, b가 주어진다. ( a, b ≥ 1, a + b = 2n, 1 ≤ n ≤ 62.)
# 출력
# 각 테스트 케이스마다 한 줄에 강산이와 지현이가 동굴을 최대한 빨리 떠났을 때 며칠이 지났는지 출력한다.

for _ in range(int(input())):
    n, a, b = map(int, input().split())
    count = -1
    n2 = 1
    if a%2 == 1:
        print(n)
    else:
        for _ in range(n):
            n2 *= 2
        while a != 0:
            if a >= n2:
                a-= n2
            n2 //= 2
            count+=1
        print(count)